БухЭксп/Catalogs/CW_НастройкиВыводаСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиВыводаСтатистики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредопределеннаяКолонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФорматЗначения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_НастройкиВыводаСтатистики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокДоступныхОбъектовНастройкм();
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторОбъекта) Тогда
		ЗаполнитьСписокДоступныхКолонок();
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		Объект.Наименование = Объект.ИдентификаторОбъекта.Синоним;
		
		НоваяСтрока = Объект.НастройкиКолонок.Добавить();
		
		НоваяСтрока.Имя   					= "Ссылка";
		НоваяСтрока.Синоним    				= "Ссылка";
		НоваяСтрока.Заголовок  				= "Документ";
		НоваяСтрока.ПредопределеннаяКолонка = Истина;
		
	КонецЕсли;
	
	ЗаполнитьДополнительныеКолонки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхОбъектовНастройкм()
	
	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_ВладельцыСтатуса.Тип.Типы();
	
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);
		Элементы.ИдентификаторОбъекта.СписокВыбора.Добавить(Идентификатор);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеКолонки()
	
	Для Каждого СтрокаНастроек из Объект.НастройкиКолонок Цикл
		СтрокаНастроек.ИндексКартинки = ПолучитьИндексКартинкиСтроки(СтрокаНастроек);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИндексКартинкиСтроки(СтрокаНастроек)
	
	Если СтрокаНастроек.ПредопределеннаяКолонка Тогда
		Возврат 6;
	КонецЕсли;
	
	мСтроки = ДоступныеРеквизиты.НайтиСтроки(Новый Структура("Имя", СтрокаНастроек.Имя));
	Если мСтроки.Количество() = 0 Тогда
		Возврат 25;
	КонецЕсли;
	
	Возврат 4;
	
КонецФункции

&НаКлиенте
Процедура ИдентификаторОбъектаПриИзменении(Элемент)
	 
	Отбор = Новый Структура("ТолькоПросмотр", Ложь);
	мСтроки = Объект.НастройкиКолонок.НайтиСтроки(Отбор);

	Если ЗначениеИдентификаторОбъектаИзменено() и мСтроки.Количество() > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПродолжитьИзменениеОбъекта", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, "Настройки колонок будут очищены. Продоложить?", Режим, 0);
	Иначе
		ЗаполнитьСписокДоступныхКолонок();
		ЗаполнитьДополнительныеКолонки();
	КонецЕсли;
	
	ИдентификаторОбъектаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИдентификаторОбъектаПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.ИдентификаторОбъекта.Синоним;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПродолжитьИзменениеОбъекта(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.ИдентификаторОбъекта = Объект.Ссылка.ИдентификаторОбъекта;
        Возврат;
    КонецЕсли;
	
	Отбор = Новый Структура("ТолькоПросмотр", Ложь);
	мСтроки = Объект.НастройкиКолонок.НайтиСтроки(Отбор);
	
	Для Каждого СтрокаМассива из мСтроки Цикл
		Объект.НастройкиКолонок.Удалить(СтрокаМассива);
	КонецЦикла;
	
	ЗаполнитьСписокДоступныхКолонок();
	ЗаполнитьДополнительныеКолонки();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхКолонок()
	
	ЭтоСправочник 		= Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки));
	ЭтоДокумент 		= Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Объект.ИдентификаторОбъекта.ЗначениеПустойСсылки));
	МетаданныеОбъекта 	= ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Объект.ИдентификаторОбъекта);
	
	мСтандартныеРеквизиты = Новый Массив;
	Если ЭтоСправочник Тогда
		мСтандартныеРеквизиты.Добавить("Код");
		мСтандартныеРеквизиты.Добавить("Наименование");
		мСтандартныеРеквизиты.Добавить("Владелец");
		
		Если МетаданныеОбъекта.Иерархический Тогда
			мСтандартныеРеквизиты.Добавить("Родитель");
		КонецЕсли;
		
	КонецЕсли;
	Если ЭтоДокумент Тогда
		мСтандартныеРеквизиты.Добавить("Номер");
		мСтандартныеРеквизиты.Добавить("Дата");
	КонецЕсли;

	ДоступныеРеквизиты.Очистить();
	
	Для Каждого Реквизит из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		Если мСтандартныеРеквизиты.Найти(Реквизит.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
			
		НоваяСтрока = ДоступныеРеквизиты.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизит);
		НоваяСтрока.Имя    	= Реквизит.Имя;
		НоваяСтрока.Синоним = ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним);

		
		ТипЗначенияСтрокой = ПолучитьТипЗначенияСтрокой(Реквизит.Тип);
		Если Не ПустаяСтрока(ТипЗначенияСтрокой) Тогда 
			НоваяСтрока.ДоступенФорматЗначения 	= Истина;
			НоваяСтрока.ТипЗначенияСтрокой 		= ТипЗначенияСтрокой;
		КонецЕсли;
		
	КонецЦикла;

	Для Каждого Реквизит из МетаданныеОбъекта.Реквизиты Цикл
		
		НоваяСтрока = ДоступныеРеквизиты.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Реквизит);
		
		ТипЗначенияСтрокой = ПолучитьТипЗначенияСтрокой(Реквизит.Тип);
		Если Не ПустаяСтрока(ТипЗначенияСтрокой) Тогда 
			НоваяСтрока.ДоступенФорматЗначения 	= Истина;
			НоваяСтрока.ТипЗначенияСтрокой 		= ТипЗначенияСтрокой;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТипЗначенияСтрокой(ТипЗначения) 
	
	ТипЗначенияСтрокой = "";
	
	Если ТипЗначения.СодержитТип(Тип("Число")) Тогда
		ТипЗначенияСтрокой = "Число";
	КонецЕсли;
	Если ТипЗначения.СодержитТип(Тип("Дата")) Тогда
		ТипЗначенияСтрокой = ТипЗначенияСтрокой+?(ПустаяСтрока(ТипЗначенияСтрокой),"",";")+"Дата";
	КонецЕсли;
	Если ТипЗначения.СодержитТип(Тип("Булево")) Тогда
		ТипЗначенияСтрокой = ТипЗначенияСтрокой+?(ПустаяСтрока(ТипЗначенияСтрокой),"",";")+"Булево";
	КонецЕсли;	
	
	Возврат ТипЗначенияСтрокой;
	
КонецФункции


&НаСервере
Функция ЗначениеИдентификаторОбъектаИзменено()
	
	Возврат Объект.ИдентификаторОбъекта <> Объект.Ссылка.ИдентификаторОбъекта;
	
КонецФункции

&НаКлиенте
Процедура НастройкиКолонокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.ИдентификаторОбъекта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбран объект печатной формы",,"ИдентификаторОбъекта", "Объект");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьВыборРеквизитов", ЭтотОбъект);
	
	АдресСписокРеквизитовДляВыбора = ПолучитьСписокРеквизитов();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаЗначений"	, АдресСписокРеквизитовДляВыбора);
	ПараметрыФормы.Вставить("СписокСПометками"		, Ложь);
	ПараметрыФормы.Вставить("ЗаголовокФормы"		, "Доступные реквизиты");
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораИзСписка",ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте 
Процедура ПродолжитьВыборРеквизитов(РезультатВыбора, Параметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ДанныеРеквизита =  ПолучитьИзВременногоХранилища(РезультатВыбора);
	
	НоваяСтрока = Объект.НастройкиКолонок.Добавить();
	НоваяСтрока.Имя 			= ДанныеРеквизита.Значение; 
	НоваяСтрока.Синоним 		= ДанныеРеквизита.Представление; 
	НоваяСтрока.Заголовок 		= ДанныеРеквизита.Представление; 
	НоваяСтрока.ИндексКартинки 	= 4; 
	
	мСтроки = ДоступныеРеквизиты.НайтиСтроки(Новый Структура("Имя", ДанныеРеквизита.Значение));
	Если мСтроки.Количество() > 0 Тогда
		НоваяСтрока.Формат 					= мСтроки[0].Формат; 
		НоваяСтрока.ТипЗначенияСтрокой 		= мСтроки[0].ТипЗначенияСтрокой; 
		НоваяСтрока.ДоступенФорматЗначения 	= мСтроки[0].ДоступенФорматЗначения; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРеквизитов()
	
	СписокРеквизитов = Новый СписокЗначений;
	
	Для Каждого ДанныеРеквизита из ДоступныеРеквизиты Цикл
		мСтроки = Объект.НастройкиКолонок.НайтиСтроки(Новый Структура("Имя", ДанныеРеквизита.Имя));
		Если мСтроки.Количество() = 0 Тогда
			СписокРеквизитов.Добавить(ДанныеРеквизита.Имя, ДанныеРеквизита.Синоним,, БиблиотекаКартинок.Реквизит);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(СписокРеквизитов, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДополнительныеКолонки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКолонокФорматКолнкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИдентификаторСтроки = Элементы.НастройкиКолонок.ТекущаяСтрока;
	ТекущиеДанные 		= Элементы.НастройкиКолонок.ТекущиеДанные;
	
	мСтрТипы = СтрРазделить(ТекущиеДанные.ТипЗначенияСтрокой,";",Истина);
	
	мТипы = Новый Массив;
	Для Каждого СтрТип из мСтрТипы Цикл
		мТипы.Добавить(Тип(СтрТип));
	КонецЦикла;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияФормата",ЭтотОбъект, ИдентификаторСтроки);
	
	Конструктор = Новый КонструкторФорматнойСтроки;
	Конструктор.Текст = ТекущиеДанные.Формат;
	Конструктор.ДоступныеТипы = Новый ОписаниеТипов(мТипы);
	Конструктор.Показать(ОписаниеОповещения);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаИзмененияФормата(Текст, ИдентификаторСтроки) Экспорт 
	
	СтрокаТекущая = Объект.НастройкиКолонок.НайтиПоИдентификатору(ИдентификаторСтроки);
	СтрокаТекущая.Формат = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиКолонокПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.НастройкиКолонок.ТекущиеДанные;
	Отказ = ТекущиеДанные.ПредопределеннаяКолонка;
	
КонецПроцедуры
